In [5]:
import pandas as pd
csvframe = pd.read_csv('winequality-red.csv')
csvframe
print(csvframe)

       7.4    0.7     0  1.9  0.076    11    34   0.9978  3.51  0.56   9.4  5
0      7.8  0.880  0.00  2.6  0.098  25.0  67.0  0.99680  3.20  0.68   9.8  5
1      7.8  0.760  0.04  2.3  0.092  15.0  54.0  0.99700  3.26  0.65   9.8  5
2     11.2  0.280  0.56  1.9  0.075  17.0  60.0  0.99800  3.16  0.58   9.8  6
3      7.4  0.700  0.00  1.9  0.076  11.0  34.0  0.99780  3.51  0.56   9.4  5
4      7.4  0.660  0.00  1.8  0.075  13.0  40.0  0.99780  3.51  0.56   9.4  5
...    ...    ...   ...  ...    ...   ...   ...      ...   ...   ...   ... ..
1593   6.2  0.600  0.08  2.0  0.090  32.0  44.0  0.99490  3.45  0.58  10.5  5
1594   5.9  0.550  0.10  2.2  0.062  39.0  51.0  0.99512  3.52  0.76  11.2  6
1595   6.3  0.510  0.13  2.3  0.076  29.0  40.0  0.99574  3.42  0.75  11.0  6
1596   5.9  0.645  0.12  2.0  0.075  32.0  44.0  0.99547  3.57  0.71  10.2  5
1597   6.0  0.310  0.47  3.6  0.067  18.0  42.0  0.99549  3.39  0.66  11.0  6

[1598 rows x 12 columns]

In [6]:
table=pd.read_table('winequality-red.csv',sep=',')
table

       7.4    0.7     0  1.9  0.076    11    34   0.9978  3.51  0.56   9.4  5
0      7.8  0.880  0.00  2.6  0.098  25.0  67.0  0.99680  3.20  0.68   9.8  5
1      7.8  0.760  0.04  2.3  0.092  15.0  54.0  0.99700  3.26  0.65   9.8  5
2     11.2  0.280  0.56  1.9  0.075  17.0  60.0  0.99800  3.16  0.58   9.8  6
3      7.4  0.700  0.00  1.9  0.076  11.0  34.0  0.99780  3.51  0.56   9.4  5
4      7.4  0.660  0.00  1.8  0.075  13.0  40.0  0.99780  3.51  0.56   9.4  5
...    ...    ...   ...  ...    ...   ...   ...      ...   ...   ...   ... ..
1593   6.2  0.600  0.08  2.0  0.090  32.0  44.0  0.99490  3.45  0.58  10.5  5
1594   5.9  0.550  0.10  2.2  0.062  39.0  51.0  0.99512  3.52  0.76  11.2  6
1595   6.3  0.510  0.13  2.3  0.076  29.0  40.0  0.99574  3.42  0.75  11.0  6
1596   5.9  0.645  0.12  2.0  0.075  32.0  44.0  0.99547  3.57  0.71  10.2  5
1597   6.0  0.310  0.47  3.6  0.067  18.0  42.0  0.99549  3.39  0.66  11.0  6

[1598 rows x 12 columns]

In [8]:
csvframe1 = pd.read_csv('/home/el_professor258/Documents/Py-Repository/Indian Liver Patient Dataset (ILPD).csv',header=None)
csvframe1

     0       1     2    3    4   5    6    7    8     9   10
0    65  Female   0.7  0.1  187  16   18  6.8  3.3  0.90   1
1    62    Male  10.9  5.5  699  64  100  7.5  3.2  0.74   1
2    62    Male   7.3  4.1  490  60   68  7.0  3.3  0.89   1
3    58    Male   1.0  0.4  182  14   20  6.8  3.4  1.00   1
4    72    Male   3.9  2.0  195  27   59  7.3  2.4  0.40   1
..   ..     ...   ...  ...  ...  ..  ...  ...  ...   ...  ..
578  60    Male   0.5  0.1  500  20   34  5.9  1.6  0.37   2
579  40    Male   0.6  0.1   98  35   31  6.0  3.2  1.10   1
580  52    Male   0.8  0.2  245  48   49  6.4  3.2  1.00   1
581  31    Male   1.3  0.5  184  29   32  6.8  3.4  1.00   1
582  38    Male   1.0  0.3  216  21   24  7.3  4.4  1.50   2

[583 rows x 11 columns]

In [9]:
csvframe1=pd.read_csv('/home/el_professor258/PycharmProjects/pythonProject/Indian Liver Patient Dataset (ILPD).csv', names=['white','red','blue','green','animal'])
csvframe1

                           white  red  blue  green  animal
65 Female 0.7  0.1 187 16     18  6.8   3.3   0.90       1
62 Male   10.9 5.5 699 64    100  7.5   3.2   0.74       1
          7.3  4.1 490 60     68  7.0   3.3   0.89       1
58 Male   1.0  0.4 182 14     20  6.8   3.4   1.00       1
72 Male   3.9  2.0 195 27     59  7.3   2.4   0.40       1
...                          ...  ...   ...    ...     ...
60 Male   0.5  0.1 500 20     34  5.9   1.6   0.37       2
40 Male   0.6  0.1 98  35     31  6.0   3.2   1.10       1
52 Male   0.8  0.2 245 48     49  6.4   3.2   1.00       1
31 Male   1.3  0.5 184 29     32  6.8   3.4   1.00       1
38 Male   1.0  0.3 216 21     24  7.3   4.4   1.50       2

[583 rows x 5 columns]

In [5]:
csvframe2=pd.read_csv('myCSV_03.csv', index_col=['color','status'])
csvframe2

              item1  item2  item3
color status
black up          3      4      6
      down        2      6      7
white up          5      5      5
      down        3      3      2
      left        1      2      1
red   up          2      2      2
      down        1      1      4

In [6]:
data=pd.read_table('ch05_04.txt',sep='\s+')
data

   white  red  blue  green
0      1    5     2      3
1      2    7     8      5
2      3    3     6      7

In [8]:
data=pd.read_table('ch05_05.txt',sep='\D+')
data

C:\Users\MAHE\AppData\Local\Temp\ipykernel_9512\3346693098.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  data=pd.read_table('ch05_05.txt',sep='\D+')

   000  123  122
0    1  124  321
1    2  125  333

In [10]:
data1=pd.read_table('ch05_06.txt',sep=',', skiprows=[0,1,3,6])
data1

                                               white  red  blue  green animal
0  12-Feb-2015: Counting of animals inside the house  NaN   NaN    NaN    NaN
1                                                  1  5.0   2.0    3.0    cat
2                                                  2  7.0   8.0    5.0    dog
3                                                  3  3.0   6.0    7.0  horse
4                                                  2  2.0   8.0    3.0   duck
5                                                  4  4.0   2.0    1.0  mouse

In [11]:
pd.read_csv('myCSV_02.csv')

   1  5  2  3    cat
0  2  7  8  5    dog
1  3  3  6  7  horse
2  2  2  8  3   duck
3  4  4  2  1  mouse

In [12]:
pd.read_csv('myCSV_02.csv',skiprows=[1],nrows=2)

   1  5  2  3    cat
0  3  3  6  7  horse
1  2  2  8  3   duck

In [13]:
data = {'color' : ['blue','green','yellow','red','white'],
'object' : ['ball','pen','pencil','paper','mug'],
'price' : [1.2,1.0,0.6,0.9,1.7]}
frame=pd.DataFrame(data)
frame

    color  object  price
0    blue    ball    1.2
1   green     pen    1.0
2  yellow  pencil    0.6
3     red   paper    0.9
4   white     mug    1.7

In [26]:
frame.to_csv('myCSV_04.csv')

In [14]:
frame.to_csv('myCSV_04.csv', header=False,index=False)

In [15]:
import numpy as np
data1 = {'color' : ['blue','green','yellow','red','white'],
'object' : ['ball','pen',np.nan,'paper','mug'],
'price' : [1.2,1.0,0.6,0.9,np.nan]}
frame1=pd.DataFrame(data1)
frame1

    color object  price
0    blue   ball    1.2
1   green    pen    1.0
2  yellow    NaN    0.6
3     red  paper    0.9
4   white    mug    NaN

In [18]:
frame1.to_csv('myCSV_05.csv', na_rep ='2')
frame1

    color object  price
0    blue   ball    1.2
1   green    pen    1.0
2  yellow    NaN    0.6
3     red  paper    0.9
4   white    mug    NaN

In [28]:
import numpy as np, pandas as pd
frame = pd.DataFrame(np.arange(4).reshape(2,2))
frame

   0  1
0  0  1
1  2  3

In [19]:
print(frame.to_html())

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>color</th>
      <th>object</th>
      <th>price</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>blue</td>
      <td>ball</td>
      <td>1.2</td>
    </tr>
    <tr>
      <th>1</th>
      <td>green</td>
      <td>pen</td>
      <td>1.0</td>
    </tr>
    <tr>
      <th>2</th>
      <td>yellow</td>
      <td>pencil</td>
      <td>0.6</td>
    </tr>
    <tr>
      <th>3</th>
      <td>red</td>
      <td>paper</td>
      <td>0.9</td>
    </tr>
    <tr>
      <th>4</th>
      <td>white</td>
      <td>mug</td>
      <td>1.7</td>
    </tr>
  </tbody>
</table>

In [20]:
frame1 = pd.DataFrame( np.random.random((4,4)),
index = ['white','black','red','blue'],
columns = ['up','down','right','left'])
frame1

             up      down     right      left
white  0.487752  0.376325  0.437785  0.508725
black  0.871448  0.027546  0.620046  0.251708
red    0.239736  0.558204  0.015271  0.826520
blue   0.472183  0.930837  0.822474  0.583171

In [33]:
print(frame1.to_html())

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>up</th>
      <th>down</th>
      <th>right</th>
      <th>left</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>white</th>
      <td>0.588136</td>
      <td>0.404866</td>
      <td>0.258536</td>
      <td>0.553348</td>
    </tr>
    <tr>
      <th>black</th>
      <td>0.692772</td>
      <td>0.091566</td>
      <td>0.035798</td>
      <td>0.362849</td>
    </tr>
    <tr>
      <th>red</th>
      <td>0.220379</td>
      <td>0.261414</td>
      <td>0.971496</td>
      <td>0.997462</td>
    </tr>
    <tr>
      <th>blue</th>
      <td>0.779700</td>
      <td>0.355639</td>
      <td>0.764275</td>
      <td>0.008029</td>
    </tr>
  </tbody>
</table>

In [20]:
s = ['<HTML>']
s.append('<HEAD><TITLE>My DataFrame</TITLE></HEAD>')
s.append('<BODY>')
s.append(frame1.to_html())
s.append('</BODY></HTML>')
html = ''.join(s)
html_file = open('myFrame.html','w')
html_file.write(html)
html_file.close()

In [21]:
web_frames = pd.read_html('myFrame.html')
web_frames

[  Unnamed: 0        up      down     right      left
 0      white  0.132421  0.885554  0.989160  0.543268
 1      black  0.053717  0.265563  0.142284  0.399578
 2        red  0.893555  0.879569  0.421665  0.659888
 3       blue  0.592942  0.528855  0.045906  0.514163]

In [22]:
from lxml import objectify
xml = objectify.parse('books.xml')
xml
root = xml.getroot()
root

In [40]:
root.Book.PublishDate

'2014-22-01'

In [39]:
root.getchildren()

In [50]:
pip install xlrd

Requirement already satisfied: xlrd in c:\users\mahe\anaconda3\lib\site-packages (2.0.1)
Note: you may need to restart the kernel to use updated packages.

In [23]:
import pandas as pd
pd.read_excel('data.xls')

  Unnamed: 0  white  red  green  black
0          a     12   23     17     18
1          b     22   16     19     18
2          c     14   23     22     21

In [42]:
pd.read_excel('data.xls','Sheet2')

  Unnamed: 0  Yellow  Purple  blue  orange
0          A      11      16    44      22
1          B      20      22    23      44
2          C      30      31    37      32

In [24]:
pd.read_excel('data.xls',1)

  Unnamed: 0  Yellow  Purple  blue  orange
0          A      11      16    44      22
1          B      20      22    23      44
2          C      30      31    37      32

In [25]:
import numpy as np, pandas as pd
frame = pd.DataFrame(np.random.random((4,4)),
index = ['exp1','exp2','exp3','exp4'],
columns = ['Jan2015','Fab2015','Mar2015','Apr2005'])
frame

       Jan2015   Fab2015   Mar2015   Apr2005
exp1  0.504600  0.569534  0.083141  0.047784
exp2  0.200506  0.812085  0.495881  0.042548
exp3  0.857980  0.009340  0.188381  0.990552
exp4  0.441073  0.867132  0.348894  0.965085

In [15]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\mahe\anaconda3\lib\site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in c:\users\mahe\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [44]:
#print(frame)
frame.to_excel(r'datanew.xlsx',index=False)

In [26]:
frame.to_json('frame.json')

In [27]:
pd.read_json('frame1.json')

       Jan2015   Fab2015   Mar2015   Apr2005
exp1  0.968293  0.004484  0.546031  0.794826
exp2  0.158264  0.238459  0.006140  0.578155
exp3  0.489690  0.618656  0.906063  0.618340
exp4  0.689329  0.832019  0.775667  0.875011
exp5  0.010000  0.010000  0.010000  0.010000

In [69]:
#from pandas.io.json import json_normalize
from pandas import json_normalize
file = open('books.json','r')
text = file.read()
text
#text = json.loads(text)
#data=json_normalize(text,sep=',')

'[{"writer": "Mark Ross",\n"nationality": "USA",\n"books": [\n{"title": "XML Cookbook", "price": 23.56},\n{"title": "Python Fundamentals", "price": 50.70},\n{"title": "The NumPy library", "price": 12.30}\n]\n},\n {"writer": "Barbara Bracket",\n"nationality": "UK",\n"books": [\n{"title": "Java Enterprise", "price": 28.60},\n{"title": "HTML5", "price": 31.35},\n{"title": "Python for Dummies", "price": 28.00}\n]\n}]'

In [2]:
import pandas as pd, numpy as np
from pandas.io.pytables import HDFStore

In [4]:
frame5 = pd.DataFrame(np.arange(16).reshape(4,4),
index=['white','black','red','blue'],
columns=['up','down','right','left'])
frame5

       up  down  right  left
white   0     1      2     3
black   4     5      6     7
red     8     9     10    11
blue   12    13     14    15

In [5]:
store = HDFStore('mydata.h5')
store['obj1'] = frame5
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [6]:
frame6 = pd.DataFrame(np.arange(9).reshape(3,3),
index=['white','black','red'],
columns=['up','down','right'])
frame6

       up  down  right
white   0     1      2
black   3     4      5
red     6     7      8

In [7]:
store['obj2'] = frame6
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [13]:
store['obj2']

       up  down  right
white   0     1      2
black   3     4      5
red     6     7      8

In [8]:
import pickle

In [9]:
data = { 'color': ['white','red'], 'value': [5, 7]}
data

{'color': ['white', 'red'], 'value': [5, 7]}

In [10]:
pickled_data = pickle.dumps(data)
pickled_data

b'\x80\x04\x95/\x00\x00\x00\x00\x00\x00\x00}\x94(\x8c\x05color\x94]\x94(\x8c\x05white\x94\x8c\x03red\x94e\x8c\x05value\x94]\x94(K\x05K\x07eu.'

In [11]:
nframe = pickle.loads(pickled_data)
nframe

{'color': ['white', 'red'], 'value': [5, 7]}

In [12]:
frame = pd.DataFrame(np.arange(16).reshape(4,4), index = ['up','down','left','right'])
frame

        0   1   2   3
up      0   1   2   3
down    4   5   6   7
left    8   9  10  11
right  12  13  14  15

In [98]:
frame.to_pickle('frame.pkl')

In [13]:
import pandas as pd
pd.read_pickle('frame.pkl')

        0   1   2   3
up      0   1   2   3
down    4   5   6   7
left    8   9  10  11
right  12  13  14  15

In [3]:
from sqlalchemy import create_engine
pip install ipython-sql

SyntaxError: invalid syntax (365975064.py, line 2)

In [11]:
con = Oracle.connect('username/password@localhost')

NameError: name 'Oracle' is not defined

In [18]:
os = ('w', 'i', 'n', 'd', 'o', 'w', 's')
os1 = ('w', 'i', 'n', 'd', 'w', 's', 'o')
os<os1

True

In [20]:
type((3,))

tuple

In [24]:
tuple_1 = (7,8,9,10,11,12,13)
tuple_1[-1:1:-1]

(13, 12, 11, 10, 9)

In [27]:
A = ("hello",) * 3
print(A)

('hello', 'hello', 'hello')

In [28]:
number_1 = {1,2,3,4,5}
number_2 = {1,2,3}
number_1.difference(number_2)

{4, 5}